#control flow เเบ่งเป็น 2 กลุ่ม / control statement เเยกเป็น 2 กลุ่ม
#1. selection/decision เลือกทำ คือ ต้้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ เเยกเป็น 3 เเบบย่อย
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ (if-else)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ (if-elif-else)

#2. loop/interration/repeatition ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ เเยกเป็น 2 เเบบ
# - รู้จำนวนครั้งในการทำซ้ำ
# - ไม่รู้จำนวนครั้งในการทำซ้ำ
# while,for
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ***