print('-------------------------------')
print('โปรเเกรมตรวจสอบช้อมูลสายรถเมลล์')
print('-------------------------------')
Bus_ID = input('กรุณากรอกหมายเลขสายรถเมลล์ : ')
Bus_ID = int(Bus_ID)
if Bus_ID >= 1 and Bus_ID <= 999:
    if Bus_ID >= 57: 
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ ไปปิ่นเกล้า บางขุนนนท์')
    elif Bus_ID >= 3 : 
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ ไปสนามหลวง ลาดพร้าว ')
    elif Bus_ID >= 71 :
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ ไปหัวลำโพง เยาวราช')
    elif Bus_ID >= 56 :
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ ไปบางลำพู สะพานกรุงธน')
    elif Bus_ID >= 539 :
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ ไปอนุสาวรีย์ชัย สามเเสนส')
    else:
        print('รถเมลล์สาย', Bus_ID, 'เป็นรถเมลล์ในเขตต่างจังหวัด')
else:
    print('หมายเลขสายรถเมลล์ไม่ถูกต้อง')
print('--------------------------------')
