# Assiment Operator กำหนดค่า คิอ =
# การทำงานของ =  คื การเอาทางขวาไปใส่ทางซ้าย
# ยกเว้นว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำงให้เสร็จเเล้วเอาผลที่ได้ไปใส่ทางซ้าย
# ตัวแปร (Variable) = ช้อใูล (data) / นิพจน์ (expression)
# ********** ตัวแปรคือชื่อที่Dev ตั้งขึ้น ไว้เก็บข้อมูล ********* 
# ******** การใช้งานตัวแปร คือ เอาข้อมลไปใส่ในตัวแปร หรือ เอาข้อมูลที่เก็บอยู่มาใช้ **********

score = 50
Fullname = 'Ralf Rangnok'
salary = input ('ป้อนเงินเดือน: ')
sum = 50 + 90
print('-----------------------------')
num=10
num += 10
num -= 10
num *= 10
num /= 10
num %= 10
num //= 10
print(num)
print('-----------------------------')  
