#สร้างโปรเเกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษี7% ของเงินเดือน เเละักค่าประกัรสังคม 3% ของเงินเดือน
#โดยรับค่ารหัสพนักงาน เงินเดือน  ทางเเป้นพิมพ์ เเละเเสดงข้อมูลที่รับมา
#ำร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าสประกันสังคมกี่บาท เเละต้องจ่ายเงินเดือนกี่บาท

print('-----------------------------')
print('โปรแกรมคํานวณเงินเดือน')
print('-----------------------------')
emp_id = input('ป้อนรหัสพนักงาน')
emp_name = input('ป้อนชื่อพนักงาน')
emp_salary = input('ป้อนเงินเดือน')
print('-----------------------------')
tax = float(emp_salary) * 0.07 #tax = emp_salary * 0.07
insurance = float(emp_salary) * 0.03 #insurance = emp_salary * 0.03
emp_salary_net = float(emp_salary) - tax - insurance #emp_salary_net = emp_salary - tax - insurance
print(f'รหัสพนักงาน: {emp_id} =ชื่อพนักงาน: {emp_name} เงินเดือน: {emp_salary}')
print(f'ต้องเสียภาษี {tax} บาท')
print(f'หักค่าประกันสังคม {insurance} บาท')
print(f'ต้องจ่ายเงินเดือน {emp_salary_net} บาท')
print('-----------------------------')  
#ใช้ ,
print("รหัสพนักงาน:", emp_id, "ชื่อพนักงาน:", emp_name , "เงินเดือน:", emp_salary) #รหัสพนักงาน,ชื่อพนักงาน,เงินเดือน)
print("ต้องเสียภาษี", tax, "บาท") #ต้องเสียภาษี,tax,บาท)
print("หักค่าประกันสังคม", insurance, "บาท") #หักค่าประกันสังคม,insurance,บาท)
print("ต้องจ่ายเงินเดือน", emp_salary_net, "บาท") #ต้องจ่ายเงินเดือน,emp_salary_net,บาท)
print('-----------------------------')
#ใช้ +
print('รหัสพนักงาน:' + emp_id + 'ชื่อพนักงาน:' + emp_name + 'เงินเดือน:' + emp_salary)
print('ต้องเสียภาษี' + str(tax) + 'บาท')
print('หักค่าประกันสังคม' + str(insurance) + 'บาท')
print('ต้องจ่ายเงินเดือน' + str(emp_salary_net) + 'บาท')
print('-----------------------------')
#ใช้ format
print('รหัสพนักงาน:{} ชื่อพนักงาน:{} เงินเดือน:{}'.format(emp_id,emp_name,emp_salary))
print('ต้องเสียภาษี {} บาท'.format(tax))
print('หักค่าประกันสังคม {} บาท'.format(insurance))
print('ต้องจ่ายเงินเดือน {} บาท'.format(emp_salary_net))
print('-----------------------------')

