print('-------------')
print('โปรเเเกรมจรวจสอบน้ำหนักรถบรรทุก')
print('--------------')
weight = float(input('กรุณากรอกน้ำหนักรถบรรทุก (ตัน) : '))
Car_ID = input('กรุณากรอกหมายเลขทะเบียนรถบรรทุก : ')
if weight > 1000:
    print('รถบรรทุกคันนี้มีน้ำหนักเกินกว่าที่กฎหมายกำหนด')
    print('โปรดติดต่อเจ้าหน้าที่ตำรวจจราจร')
    print('หมายเลขทะเบียนรถบรรทุก :', Car_ID)
    print('น้ำหนักรถบรรทุก :', weight, 'ตัน')
else:
    print('รถบรรทุกคันนี้มีน้ำหนักไม่เกินกว่าที่กฎหมายกำหนด(สามารถผ่านได้)')
    print('หมายเลขทะเบียนรถบรรทุก :', Car_ID)
    print('น้ำหนักรถบรรทุก :', weight, 'ตัน')
